<?php

namespace Database\Seeders;

use Illuminate\Cache\Events\CacheEvent;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Category;
use App\Models\Post;
use Carbon\Carbon;
use Illuminate\Support\Facades\DB;


class CategoriesAndPostsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $categories = [
            ['title' => 'Книга', 'slug' => 'book','text_color'=>'black','bg_color'=>'red'],
            ['title' => 'Списание', 'slug' => 'magazine','text_color'=>'black','bg_color'=>'blue'],
            ['title' => 'Статия', 'slug' => 'article','text_color'=>'black','bg_color'=>'yellow'],
            ['title' => 'Доклад', 'slug' => 'report','text_color'=>'black','bg_color'=>'green'],
        ];
        $authors =[
            ['first_name' => 'Ева', 'last_name'=> 'Иванова', 'image'=>'https://media.istockphoto.com/id/638917964/photo/intelligent-matur-female-math-professor-in-classroom.jpg?s=612x612&w=0&k=20&c=SyKgG4EJMhTf9q_kMy1jT7dbwXQyjiSbZ1k5aJIyfZ8='],
            ['first_name' => 'Петър', 'last_name'=> 'Петров', 'image'=>'https://www.nat.tum.de/fileadmin/w00bzl/nat/news/Zeilinger_20210215_C_jacqueline_godany.jpg'],
            ['first_name' => 'Анна', 'last_name'=> 'Ангелова', 'image'=>'https://oakland.edu/Assets/Oakland/oumagazine/graphics/news/secs/2021/OakleyB1280.jpg'],
            ['first_name' => 'Иван', 'last_name'=> 'Илиев', 'image'=>'https://m.faz.net/media1/ppmedia/aktuell/karriere-hochschule/225782149/1.3266053/mmobject-still_full/prof-dr-alfred-ziegler.jpg'],
            ['first_name' => 'Стефан', 'last_name'=> 'Стефанов', 'image'=>'https://www.betootaadvocate.com/wp-content/uploads/2018/06/chemistry.jpg'],
            ['first_name' => 'Лиляна', 'last_name'=> 'Лилова', 'image'=>'https://www.cambridgenetwork.co.uk/sites/default/files/styles/article_main/public/Vice-Chancellor%20Professor%20Deborah%20Prentice.jpg?itok=2HXzc6_Y'],
            ['first_name' => 'Валентина', 'last_name'=> 'Василева', 'image'=>'https://www.yourfreecareertest.com/wp-content/uploads/2018/01/how_to_become_a_doctor.jpg'],
            ['first_name' => 'Симеон', 'last_name'=> 'Симеонов', 'image'=>'https://superdoc.bg/photos/doctors/large/b8nrHelyOUau5nEmtn4qUzoot3cQKO9g6WJWUCgO.jpg'],
        ];
        $posts =[
            ['user_id'=>'42','image'=>'https://media.istockphoto.com/id/1452604857/photo/businessman-touching-the-brain-working-of-artificial-intelligence-automation-predictive.jpg?s=612x612&w=0&k=20&c=GkAOxzduJbUKpS2-LX_l6jSKtyhdKlnPMo2ito4xpR4=',
                'title'=>'Еволюция на изкуствения интелект','slug'=>'evolution_ai',
                'description'=>'Що е то изкуствен интелект и съответно философия на изкуствения интелект? Няма как да продължим, без да се спрем първо на понятийното дефиниране за изкуствен интелект. Терминът „изкуствен интелект" е използван за първи път още през 1955 г. от компютърния специалист и когнитивен учен Джон Маккарти, който прави предложение за изследване през лятото на 1956 г. заедно с Марвин Мински, Алън Нюел и Хърбърт Саймън. Целта на изследването е да изясни и специфизира целите и аспектите на понятието. Конференцията се провежда през 1956 г. и става известна сред компютърните специалисти като „раждането на изкуствения интелект"(Crevier 1993: 28). Ето какво казва Маккарти в съвместна публикация с Патрик Хейс: „Компютърна програма, способна да действа интелигентно, трябва да има основна представа и интерпретация за света (...) По-конкретно, искаме компютърна програма, която да взима самостоятелни решения и използвайки формален език, да определи стратегия за тяхното постигане. Това изисква формализиране на концепции за причинност, способност и знание" - изтъква той (като определение) в своя труд Some Philosophical Problems from the Standpoint of Artificial Intelligence от 1969 г. (McCarthy, Hayes 1969: 1).
Както се забелязва, годината на дефиницията датира от средата на ХХ век, но това, съвсем не е най-ранният период, през който се е говорило за изкуствено съзнание. Фантазията и идеята на хората за него може да се проследи още от древността, където често, особено в митологията, се срещат предмети, притежаващи характеристиките на това, което днес наричаме, изкуствен интелект. Специфично отражение на идеята за свръхинтелект откриваме в мита за Хефест - син на Хера, покровител на огъня и обработката на метала, ковач на боговете. Историята разказва, че на Олимп Хефест е строил за боговете „величествени златни дворци, а за себе си построил дворец от злато, сребро и бронз" . В този дворец Хефест поставя своята ковачница, която е „пълна с чудеса". Митът разказва още, че духалото на грамадната наковалня не било нужно да се движи от ръцете на човек, а се подчинявало на Хефестовите думи. Нещо, което днес ни е познато като гласово разпознаване, заложено в модерните „умни технологии". Хефест изковава в своята ковачница златни колела, които са като живи и златни статуи, наподобяващи като представа съвременните роботи. Тези статуи имат за цел да служат на бога-ковач - говорят със собствен глас, притежават собствена сила и мисъл. Първата употреба на думата робот обаче срещаме чак през ХХ век, когато излиза „Р.У.Р.: Колективна драма с комедиен пролог и три действия" на Карел Чапек (Чапек 1990). Фантастичното произведение е публикувано през 1920 г. от парижкото издателство „Авентинум" и веднага добива световна популярност. Терминът „робот" е измислен от Йозеф Чапек - братът на Карел Чапек (Kurfess 2005: 11) и идва от чешката дума robota, която в буквален смисъл означава „принудителен труд". С времето и нарастващата популярност на произведението „робот" се налага над други названия като android и automata. Думата за принудителен труд не е случайно избрана от Йозеф Чапек. Произведението отразява най-ранните страхове на хората от превъзхождащи ги машини, които имат по-голяма сила и по-съвършен интелект. В литературното произведение машините бързо се противопоставят на хората. Те не желаят да бъдат експлоатират повече и така, в своя бунт, погубват цялото човечество.
Подобни сценарии срещаме навсякъде из популярната култура днес, а също и в научните издания и мненията на технолозите. Най-актуалните страхове по този повод са изказани от Илон Мъск - футурист, заможен бизнесмен и един от най-сериозните и големи разработчици на изкуствен интелект. Неговата програма OpenAI цели да създаде най-съвършения изкуствен интелект, който в същото време да е безопасен и за хората. Именно той изразява най-големите страхове от създаването на подобни машини, над които, в момента, липсва всякаква регулация. В интервюта от 2017 г. Мъск многократно изказва предположението, че има само 5 до 10% шанс човекът да разработи напълно безопасен изкуствен интелект. „Facebook, Google и Amazon, а може би и Apple, всички те имат повече информация за вас, отколкото вие можете да си представите. В концентрацията на власт има твърде голям риск. Така че какво ще стане, ако изкуственият интелект се сдобие с голяма власт, която се контролира само от няколко човека в Google и то без регулации?" - казва Мъск. 5 до 10% шанс хората да създадат доброжелателен изкуствен интелект са твърде малко и крият голяма несигурност, което оставя над 90% шанс сценарият на Чапек да се сбъдне. Мъск не е единствен в мнението си и получава подкрепата на някои от най-големите имена в науката като физика Стивън Хокинг. Дискусията обаче остава отворена, тъй като програмите за разработване на изкуствен интелект непрекъснато менят или добавят учени към своя състав, променяйки концепцията и крайната цел на изследванията. Така фокусът за философия на изкуствения интелект се концентрира, и измества основно, в полето на етиката и морала, като оставя на заден план другите възможности за теоретично и практическо изследване. Ако приемем, че това е така, тогава не сме далеч от заключението, че може би методиките на философията са твърде тромави, за да следват и поддържат темпото на развитие в модерния свят. От опит можем да съдим, че когато философията не реагира адекватно на съвременността, това води до появата на други проблеми, засягащи аспекти от всички научни области. Тук е мястото да направим някои важни уточнения и как бихме могли да повлияем на процеса, така че да излезем от лоното на едностранното говорене и да добием по-широка перспектива върху развитието на процесите и причинно-следствените връзки.',
                'featured'=>false,
                'created_at'=>new \DateTime('2022-11-18')],
            ['user_id'=>'43','image'=>'https://www.ligo.caltech.edu/system/pages/images/24/page/Gravity_Waves_StillImage.jpg?1699659823',
            'title'=>'Как се образуват гравитационни вълни?','slug'=>'gravity_waves',
                'description'=>'Представете си, че заедно с ваш приятел стоите на брега на някое езеро. Ако хвърлите камък във водата, ще видите как в нея се образуват малки вълни. Тъй като сте впечатлени от красотата на заобикалящата ви природа, решавате да споделите това с вашия спътник. Отваряйки устата си и започвайки да изговаряте думи, вие започвате да създавате звукови вълни. Какво, обаче, е необходимо за образуването на гравитационни вълни? Техен източник може да бъде всяка движеща се с ускорение маса или тяло. Учените обясняват, че почти всеки обект във Вселената, който прави каквото и да било, създава подобни вълни.
Означава ли това, че ако започнете да пляскате с ръце, в резултат ще се образуват гравитационни вълни? Да, макар че те ще са толкова незначителни, че на практика няма да имат никакъв ефект и ще е невъзможно да бъдат забелязани. Ако попитате някой астроном какво определя колко силна е дадена гравитационна вълна, той ще ви обясни, че нейната амплитуда е пропорционална на масата и нейното ускорение. Казано по друг начин, най-мощните гравитационни вълни се получават при взаимодействия на обекти с гигантска маса или при огромни ускорения.
Примери в това отношение са космически катаклизми като поглъщането на някоя звезда от черна дупка, свръхнови и сблъсъци на черни дупки или неутронни звезди. Представете си, че притежавате невероятната способност да пътувате из цялата Вселената. Ако се приближите на няколко километра от две сливащи се черни дупки, резултатът ще е крайно неприятен – вие буквално ще бъдете разкъсани от мощните гравитационни вълни. Ако, обаче, се отдалечите на няколкостотин километра от тях, ситуацията ще се промени драстично и вие няма да усетите дори и лек дискомфорт. От гледна точка на Земята, която е на милиони или дори милиарди светлинни години от подобни апокалиптични събития, гравитационните вълни имат амплитуда, която е не по-голяма от протон.',
            'featured'=>false,
            'created_at'=>new \DateTime('2023-9-18')],
        ];
        DB::table('categories')->insert($categories);
        DB::table('authors')->insert($authors);
        DB::table('posts')->insert($posts);
    }
}
